# Data Cleaning

## Handling missing Data

In [1]:
import pandas as pd
import numpy as np

Pandas have functions for looking about missing data. The `isna` and `isnull`.
- `NaN` : means 0/0 -- Stands for Not a Number /  undefined
- `NA` : is generally interpreted as a missing, does not exist 
-`NULL` : is for empty object.
- NaN in numeric arrays, None or NaN in object arrays, NaT in datetimelike

In [2]:
pd.isna(np.nan)

True

In [3]:
pd.isnull(pd.Series([1,np.nan,3]))

0    False
1     True
2    False
dtype: bool

In [4]:
pd.notna(
    pd.DataFrame({
        'Q': [1, 2, np.nan],
        'W': [4, np.nan, 5],
        'E': [np.nan, 7, 8]
    }
))

       Q      W      E
0   True   True  False
1   True  False   True
2  False   True   True

In [5]:
pd.notnull(5)

True

### .isna vs .isnull
- No such big difference between them. It is more likely `isna` searches for missing/unexpected/unidentified values and `isnull` searching for empty ones.
- Better use isna() to check for missing/unexpected/unidentified values in an entire DataFrame and use isnull() to check for missing values in a specific column.
- But you can use whatever tf you want.

In [6]:
sr = pd.Series([1, 2.3, 4, np.nan, 5, None, 67, 8, 'u'])

In [7]:
# getting the number of non null (not NaN) value in our series, use `isnull` for NaN
pd.notna(sr).sum()

7

The `isnull`, `notnull`, `isna`, and `notna` are also methods, not just functions so you can use it like `df.isnull` and not just `pd.isnull(df)`

Here are 4 ways to check for NaN in Pandas DataFrame:
```python
# (1) Check for NaN under a single DataFrame column:
df['your column name'].isnull().values.any()

# (2) Count the NaN under a single DataFrame column:
df['your column name'].isnull().sum()

# (3) Check for NaN under an entire DataFrame:
df.isnull().values.any()

# (4) Count the NaN under an entire DataFrame:
df.isnull().sum().sum()
```

In [8]:
df = pd.DataFrame({
        'Q': [1, 2, np.nan],
        'W': [4, np.nan, 5],
        'E': [np.nan, 7, 8]
})

In [9]:
# `pd.` instead of `df['name'].` from above 
pd.isnull(df["Q"]).sum()

1

In [10]:
df['Q'].isnull().sum

<bound method Series.sum of 0    False
1    False
2     True
Name: Q, dtype: bool>

In [11]:
df.isnull().sum()

Q    1
W    1
E    1
dtype: int64

In [12]:
df.isnull().sum().sum()

3

You can use any of these to filter out dataframes and series.

In [13]:
sr[pd.notna(sr)]

0      1
1    2.3
2      4
4      5
6     67
7      8
8      u
dtype: object

In [14]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7    False
8    False
dtype: bool

<br>

## Dropping Values

In [15]:
df['E'].dropna()

1    7.0
2    8.0
Name: E, dtype: float64

In [16]:
sr.dropna()

0      1
1    2.3
2      4
4      5
6     67
7      8
8      u
dtype: object

<br>

# Data Cleaning with DataFrames

## Dropping Null

In [17]:
df = pd.DataFrame({
    'Q': [1, 2, 12, 123],
    'W': [4, np.nan, 5, 33],
    'E': [np.nan, 7, 8, np.nan],
    'R': [np.nan, np.nan, 9, np.nan]
    }
)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Q       4 non-null      int64
 1   W       3 non-null      float64
 2   E       2 non-null      float64
 3   R       1 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 192.0 bytes

In [19]:
df.isnull()

       Q      W      E      R
0  False  False   True   True
1  False   True  False   True
2  False  False  False  False
3  False  False   True   True

In [20]:
df.isnull().sum()

Q    0
W    1
E    2
R    3
dtype: int64

In [21]:
df.isnull().sum().sum()

6

The`dropna` works well in the series earlier as it removes the `null` or `NaN` in the series and just returns the not-none objects. But if we do the same with datataframes, it will remove all the columns with null cells and return the collumns with complete data.

In [22]:
df.dropna()

    Q    W    E    R
2  12  5.0  8.0  9.0

You can use `how` parameter annd give it a value of `any` or `all`

In [23]:
df.dropna(how="all")

     Q     W    E    R
0    1   4.0  NaN  NaN
1    2   NaN  7.0  NaN
2   12   5.0  8.0  9.0
3  123  33.0  NaN  NaN

In [24]:
# default value 
df.dropna(how="any")

    Q    W    E    R
2  12  5.0  8.0  9.0

> Note: To simplify, `any` asks if there is `True` value while `all` asks if all values were `True`.

You can also use `thresh`, meaning thresheold. Adding tresh parameter and giving it any value of number will make the output allow errors in _n_ (given no.) times only.

In [25]:
df.dropna(thresh=3)

    Q    W    E    R
2  12  5.0  8.0  9.0

In [26]:
# vertically dropping, also works with `axis=columns`
df.dropna(axis=1)

     Q
0    1
1    2
2   12
3  123

## Filling Null

We can simply fill NaN objects using `.fillna()` function. It will fill the NaN with the object value you passed to it.

In [27]:
sr.fillna(0)

0      1
1    2.3
2      4
3      0
4      5
5      0
6     67
7      8
8      u
dtype: object

In [28]:
df.fillna("u")

     Q   W  E  R
0    1   4  u  u
1    2   u  7  u
2   12   5  8  9
3  123  33  u  u

In [29]:
# also work with operations
sr.fillna(sr[:8].mean())

0        1
1      2.3
2        4
3    14.55
4        5
5    14.55
6       67
7        8
8        u
dtype: object

In [30]:
df.iloc[3].fillna(101)

Q    123.0
W     33.0
E    101.0
R    101.0
Name: 3, dtype: float64

In DataFrames, we can fill different columns with different values we want.

In [31]:
df.fillna({"W": 3.14, "E": df["E"].sum(), "R": 6.7})

     Q      W     E    R
0    1   4.00  15.0  6.7
1    2   3.14   7.0  6.7
2   12   5.00   8.0  9.0
3  123  33.00  15.0  6.7

The forward fill method (`method="ffill"`) fills the NaN with the value from previous cell from the said direction. More likely copying current value and pasting it forward (only in next value is NaN. If moving vertical (`axis=0`/`axis="rows"`), the NaN will be filled with the value from its left. If moving horizontal (`axis=1`/`axis="columns"`), NaN will be replaced with the value fronm the above cell. And if no previous cell, NaN will stay as NaN.

In [32]:
df.fillna(method="ffill", axis=0)

     Q     W    E    R
0    1   4.0  NaN  NaN
1    2   4.0  7.0  NaN
2   12   5.0  8.0  9.0
3  123  33.0  8.0  9.0

In [33]:
df.fillna(method="ffill", axis="columns")

       Q     W     E     R
0    1.0   4.0   4.0   4.0
1    2.0   2.0   7.0   7.0
2   12.0   5.0   8.0   9.0
3  123.0  33.0  33.0  33.0

The Backward fill (`method="bfill"`) works opposite of forward fill. If NaN object, it will copy what's in front of it then paste backward, even the next value is NaN or not NaN.

In [34]:
sr

0       1
1     2.3
2       4
3     NaN
4       5
5    None
6      67
7       8
8       u
dtype: object

In [35]:
sr.fillna(method="ffill")

0      1
1    2.3
2      4
3      4
4      5
5      5
6     67
7      8
8      u
dtype: object

In [36]:
sr.fillna(method="bfill")

0      1
1    2.3
2      4
3      5
4      5
5     67
6     67
7      8
8      u
dtype: object

You can spot the differences on values of `sr[3]` and `sr[5]` above.

<br>

## Cleaning Not-null

In [37]:
df = pd.DataFrame({
    "Sex": ['M', 'F', 'F', 'D', '?'],
    "Age": [30, 25, 50, 19, '22yo']
})
df

  Sex   Age
0   M    30
1   F    25
2   F    50
3   D    19
4   ?  22yo

Before cleaning, we should check the values first.

In [38]:
# identifying values
df["Sex"].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [39]:
# counting values
df["Sex"].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

Now you can replace it using `.replace()`

In [40]:
# replacing a one or more column with different value
df.replace({
    "Sex": {
        "D": "M",
        "?": "F"
    },
    "Age": {
        "22yo": 22
    }
})

  Sex  Age
0   M   30
1   F   25
2   F   50
3   M   19
4   F   22

In [41]:
# another option, only works for one column
df["Age"].replace({"22yo": 22})

0    30
1    25
2    50
3    19
4    22
Name: Age, dtype: int64

<br>

## Data Cleaning Duplicates

The `.duplicated()` returns boolean (True or False) if an object in a series were repeated. It will check duplicates from top to bottom/from first to last.

In [44]:
sr = pd.Series(
    ['Q','W','W','R','T','T','Y','T'],
    index=[9,8,7,6,5,4,3,2]
)
sr

9    Q
8    W
7    W
6    R
5    T
4    T
3    Y
2    T
dtype: object

In [45]:
# duplicated will be True if an object popped up for the second time.
sr.duplicated()

9    False
8    False
7     True
6    False
5    False
4     True
3    False
2     True
dtype: bool

In [49]:
# duplicate checking from last to first
sr.duplicated(keep="last")

9    False
8     True
7    False
6    False
5     True
4     True
3    False
2    False
dtype: bool

In [53]:
# Returns True or False to duplicated values, not depending on starting point of checking
sr.duplicated(keep=False)

9    False
8     True
7     True
6    False
5     True
4     True
3    False
2     True
dtype: bool

In [59]:
sr[sr.duplicated(keep=False)]

8    W
7    W
5    T
4    T
2    T
dtype: object

In [66]:
sr.drop_duplicates(keep=False) # 'first' and 'last' value of `keep` also work in these

9    Q
6    R
3    Y
dtype: object

<br>

### Configuring Duplicate and Error Value

In [74]:
players = pd.DataFrame({
    "Name": ["K. Bryant", "L. James", "K. Bryant", "J. Morant", "K. Bryant"],
    "Pos": ["SG", "SF", "SG", "SF", "PF"]
})
players

        Name Pos
0  K. Bryant  SG
1   L. James  SF
2  K. Bryant  SG
3  J. Morant  SF
4  K. Bryant  PF

In [75]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

Just like what we expected, the `players[2]` is the only `True` since the `Name` and `Pos` attribute are repeated twice. Unlike the `players[4]`, the `Name` alone is repeated and not the position. Meaning, the `players[4]` might be a mistake, or data from other season, another player's data, etc.

The `duplicated` checks if a row has all the same values as the other rows to consider it duplicated. You can check columns individually for repeated values. You can use `subset` parameter to select columns.

In [80]:
# can check one or more columns to be compared
players.duplicated(subset=["Name"], keep=False)

0     True
1    False
2     True
3    False
4     True
dtype: bool

<br>

### Splitting Columns

In [82]:
df = pd.DataFrame({
    "Data": [
        "1989_MOP_MTLLC",
        "1991_CAYR_NRVN",
        "1989_SOC_NWA",
        "1996_AEOM_TPC",
        "1967_FS_CCR",
        "1992_FWTBT_MTLLC"
    ]
})
df

               Data
0    1989_MOP_MTLLC
1    1991_CAYR_NRVN
2      1989_SOC_NWA
3     1996_AEOM_TPC
4       1967_FS_CCR
5  1992_FWTBT_MTLLC

In [83]:
df["Data"].str.split('_')

0      [1989, MOP, MTLLC]
1      [1991, CAYR, NRVN]
2        [1989, SOC, NWA]
3       [1996, AEOM, TPC]
4         [1967, FS, CCR]
5    [1992, FWTBT, MTLLC]
Name: Data, dtype: object

In [85]:
df["Data"].str.split("_", expand=True)

      0      1      2
0  1989    MOP  MTLLC
1  1991   CAYR   NRVN
2  1989    SOC    NWA
3  1996   AEOM    TPC
4  1967     FS    CCR
5  1992  FWTBT  MTLLC

We can create another columns through the splitted data.

In [87]:
df = df["Data"].str.split("_", expand=True)

In [88]:
df.columns = ["Year", "Title", "Artist"]

In [89]:
df

   Year  Title Artist
0  1989    MOP  MTLLC
1  1991   CAYR   NRVN
2  1989    SOC    NWA
3  1996   AEOM    TPC
4  1967     FS    CCR
5  1992  FWTBT  MTLLC

In [94]:
# searching
df["Year"].str.contains('99')

0    False
1     True
2    False
3     True
4    False
5     True
Name: Year, dtype: bool

Some other features.
![other str handling method](img/additional-dataCleaning.jpg)